In [3]:
import pandas as pd 
import numpy as np
import statistics as st 
import matplotlib as plt

In [4]:
df1=pd.DataFrame({ "Name" : ["smit","kiran","nikhil","Pallavi","mahesh","priyanka","monali","prakash","dhruv","smyra"],
                    "Age" : [20,29,18,25,31,22,23,21,26,30],
                   "Gender" : ["Male","Male","Male","Female","Male","Female","Female","Male","Male","Female"]
                })
df1

       Name  Age  Gender
0      smit   20    Male
1     kiran   29    Male
2    nikhil   18    Male
3   Pallavi   25  Female
4    mahesh   31    Male
5  priyanka   22  Female
6    monali   23  Female
7   prakash   21    Male
8     dhruv   26    Male
9     smyra   30  Female

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Age     10 non-null     int64
 2   Gender  10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [8]:
nw_df=df1.groupby("Gender")
nw_df

In [9]:
for x ,y in nw_df:
    print(x)
    print(y)

Female
       Name  Age  Gender
3   Pallavi   25  Female
5  priyanka   22  Female
6    monali   23  Female
9     smyra   30  Female
Male
      Name  Age Gender
0     smit   20   Male
1    kiran   29   Male
2   nikhil   18   Male
4   mahesh   31   Male
7  prakash   21   Male
8    dhruv   26   Male

In [10]:
nw_df.min(numeric_only=1)

        Age
Gender
Female   22
Male     18

In [11]:
nw_df.median(numeric_only=True)

         Age
Gender
Female  24.0
Male    23.5

In [12]:
nw_df.max(numeric_only=1)

        Age
Gender
Female   30
Male     31

In [13]:
nw_df.mean(numeric_only=1)

              Age
Gender
Female  25.000000
Male    24.166667

In [14]:
nw_df.std(numeric_only=1)

             Age
Gender
Female  3.559026
Male    5.269409

In [15]:
nw_df.describe()

         Age
       count       mean       std   min    25%   50%    75%   max
Gender
Female   4.0  25.000000  3.559026  22.0  22.75  24.0  26.25  30.0
Male     6.0  24.166667  5.269409  18.0  20.25  23.5  28.25  31.0

In [16]:
#Subtask No 2
# Reading the dataset and loading into pandas dataframe
df1=pd.read_csv("Iris.csv")
(df1)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [17]:
df1.dtypes.value_counts()

float64    4
int64      1
object     1
dtype: int64

In [18]:
df1.shape

(150, 6)

In [19]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [45]:
print("setosa")
setosa=df1['Species']=='Iris-setosa'
print(df1[setosa].describe())

print("\nversicolor")
versicolor=df1['Species']=='Iris-versicolor'
print(df1[versicolor].describe())

print("\nvirginica")
virginica=df1['Species']=='Iris-virginica'
print(df1[virginica].describe())

setosa
             Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  50.00000       50.00000     50.000000      50.000000      50.00000
mean   25.50000        5.00600      3.418000       1.464000       0.24400
std    14.57738        0.35249      0.381024       0.173511       0.10721
min     1.00000        4.30000      2.300000       1.000000       0.10000
25%    13.25000        4.80000      3.125000       1.400000       0.20000
50%    25.50000        5.00000      3.400000       1.500000       0.20000
75%    37.75000        5.20000      3.675000       1.575000       0.30000
max    50.00000        5.80000      4.400000       1.900000       0.60000

versicolor
              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000      50.000000     50.000000      50.000000     50.000000
mean    75.50000       5.936000      2.770000       4.260000      1.326000
std     14.57738       0.516171      0.313798       0.469911      0.197753
min     51.00000       4.900000      2.000000       3.000000      1.000000
25%     63.25000       5.600000      2.525000       4.000000      1.200000
50%     75.50000       5.900000      2.800000       4.350000      1.300000
75%     87.75000       6.300000      3.000000       4.600000      1.500000
max    100.00000       7.000000      3.400000       5.100000      1.800000

virginica
              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000       50.00000     50.000000      50.000000      50.00000
mean   125.50000        6.58800      2.974000       5.552000       2.02600
std     14.57738        0.63588      0.322497       0.551895       0.27465
min    101.00000        4.90000      2.200000       4.500000       1.40000
25%    113.25000        6.22500      2.800000       5.100000       1.80000
50%    125.50000        6.50000      3.000000       5.550000       2.00000
75%    137.75000        6.90000      3.175000       5.875000       2.30000
max    150.00000        7.90000      3.800000       6.900000       2.50000